performance-tests/get_products_baseline_results.txt

         /\      Grafana   /‾‾/  
    /\  /  \     |\  __   /  /   
   /  \/    \    | |/ /  /   ‾‾\ 
  /          \   |   (  |  (‾)  |
 / __________ \  |_|\_\  \_____/ 

     execution: local
        script: performance-tests/get-products.js
        output: -

     scenarios: (100.00%) 1 scenario, 100 max VUs, 50s max duration (incl. graceful stop):
              * default: 100 looping VUs for 20s (gracefulStop: 30s)


running (01.0s), 100/100 VUs, 100 complete and 0 interrupted iterations
default   [   5% ] 100 VUs  01.0s/20s

running (02.0s), 100/100 VUs, 300 complete and 0 interrupted iterations
default   [  10% ] 100 VUs  02.0s/20s

running (03.0s), 100/100 VUs, 500 complete and 0 interrupted iterations
default   [  15% ] 100 VUs  03.0s/20s

running (04.0s), 100/100 VUs, 700 complete and 0 interrupted iterations
default   [  20% ] 100 VUs  04.0s/20s

running (05.0s), 100/100 VUs, 900 complete and 0 interrupted iterations
default   [  25% ] 100 VUs  05.0s/20s

running (06.0s), 100/100 VUs, 1100 complete and 0 interrupted iterations
default   [  30% ] 100 VUs  06.0s/20s

running (07.0s), 100/100 VUs, 1300 complete and 0 interrupted iterations
default   [  35% ] 100 VUs  07.0s/20s

running (08.0s), 100/100 VUs, 1500 complete and 0 interrupted iterations
default   [  40% ] 100 VUs  08.0s/20s

running (09.0s), 100/100 VUs, 1700 complete and 0 interrupted iterations
default   [  45% ] 100 VUs  09.0s/20s

running (10.0s), 100/100 VUs, 1900 complete and 0 interrupted iterations
default   [  50% ] 100 VUs  10.0s/20s

running (11.0s), 100/100 VUs, 2100 complete and 0 interrupted iterations
default   [  55% ] 100 VUs  11.0s/20s

running (12.0s), 100/100 VUs, 2300 complete and 0 interrupted iterations
default   [  60% ] 100 VUs  12.0s/20s

running (13.0s), 100/100 VUs, 2500 complete and 0 interrupted iterations
default   [  65% ] 100 VUs  13.0s/20s

running (14.0s), 100/100 VUs, 2700 complete and 0 interrupted iterations
default   [  70% ] 100 VUs  14.0s/20s

running (15.0s), 100/100 VUs, 2900 complete and 0 interrupted iterations
default   [  75% ] 100 VUs  15.0s/20s

running (16.0s), 100/100 VUs, 3100 complete and 0 interrupted iterations
default   [  80% ] 100 VUs  16.0s/20s

running (17.0s), 100/100 VUs, 3300 complete and 0 interrupted iterations
default   [  85% ] 100 VUs  17.0s/20s

running (18.0s), 100/100 VUs, 3500 complete and 0 interrupted iterations
default   [  90% ] 100 VUs  18.0s/20s

running (19.0s), 100/100 VUs, 3700 complete and 0 interrupted iterations
default   [  95% ] 100 VUs  19.0s/20s

running (20.0s), 100/100 VUs, 3862 complete and 0 interrupted iterations
default   [ 100% ] 100 VUs  20.0s/20s


  █ TOTAL RESULTS 

    checks_total.......: 4000    195.05373/s
    checks_succeeded...: 100.00% 4000 out of 4000
    checks_failed......: 0.00%   0 out of 4000

    ✓ status is 200

    HTTP
    http_req_duration..............: avg=11.88ms min=2.22ms   med=11.54ms  max=42.3ms   p(90)=17.03ms  p(95)=19.28ms 
      { expected_response:true }...: avg=11.88ms min=2.22ms   med=11.54ms  max=42.3ms   p(90)=17.03ms  p(95)=19.28ms 
    http_req_failed................: 0.00%  0 out of 4000
    http_reqs......................: 4000   195.05373/s

    EXECUTION
    iteration_duration.............: avg=512.3ms min=502.35ms med=511.96ms max=542.38ms p(90)=517.46ms p(95)=519.96ms
    iterations.....................: 4000   195.05373/s
    vus............................: 100    min=100       max=100
    vus_max........................: 100    min=100       max=100

    NETWORK
    data_received..................: 5.6 MB 271 kB/s
    data_sent......................: 328 kB 16 kB/s



running (20.5s), 000/100 VUs, 4000 complete and 0 interrupted iterations
default ✓ [ 100% ] 100 VUs  20s